minuteos/lib-efm32/targets/efm32/hw/GPIO.h
    //! Gets a GPIOPin instance for the specified pin on the GPIOPort
    GPIOPin Pin(int number) { return GPIOPin(this, BIT(number)); }
    //! Gets the zero-based index of the GPIOPort
    int Index() const { return GetIndex(this); }

#ifdef _GPIO_P_CTRL_SLEWRATE_MASK
    //! Configures the drive options for the GPIOPort
    /*!
     * The port is configured automatically to @ref EFM32_GPIO_DRIVE_DEFAULT
     * when configuring the first pin
     */
    void Setup(uint32_t drive = EFM32_GPIO_DRIVE_DEFAULT)
    {
#ifdef _GPIO_P_CTRL_DRIVESTRENGTH_MASK
        DBGCL("gpio", "Configuring port %c drive %s(%d), ALT %s(%d)",
            'A' + Index(),
            (drive & _GPIO_P_CTRL_DRIVESTRENGTH_MASK) == GPIO_P_CTRL_DRIVESTRENGTH_WEAK ? "WEAK" : "STRONG",
            (drive & _GPIO_P_CTRL_SLEWRATE_MASK) >> _GPIO_P_CTRL_SLEWRATE_SHIFT,
            (drive & _GPIO_P_CTRL_DRIVESTRENGTHALT_MASK) == GPIO_P_CTRL_DRIVESTRENGTHALT_WEAK ? "WEAK" : "STRONG",
            (drive & _GPIO_P_CTRL_SLEWRATEALT_MASK) >> _GPIO_P_CTRL_SLEWRATEALT_SHIFT);
#else
        DBGCL("gpio", "Configuring port %c drive %d, ALT %d",
            'A' + Index(),
            (drive & _GPIO_P_CTRL_SLEWRATE_MASK) >> _GPIO_P_CTRL_SLEWRATE_SHIFT,
            (drive & _GPIO_P_CTRL_SLEWRATEALT_MASK) >> _GPIO_P_CTRL_SLEWRATEALT_SHIFT);
#endif
        CTRL = drive;
    }
#endif

    static constexpr int GetIndex(const GPIOPort* port) { return (((uintptr_t)port) - GPIO_BASE) / sizeof(GPIOPort); }

#ifdef EFM32_PERIPHERAL_BITMOD
    volatile uint32_t* BitSetPtr() { return EFM32_BITMODPTR(true, &DOUT); }
    volatile uint32_t* BitClearPtr() { return EFM32_BITMODPTR(false, &DOUT); }
#endif
#ifdef EFM32_PERIPHERAL_BITTGL
    volatile uint32_t* TogglePtr() { return EFM32_BITTGLPTR(&DOUT); }
#else
    volatile uint32_t* TogglePtr() { return &DOUTTGL; }
#endif
    const volatile uint32_t* InputPtr() { return &DIN; }
    volatile uint32_t* OutputPtr() { return &DOUT; }

    //! Suppress trace messages when reconfiguring pins
    static void SuppressConfigTrace() { _Trace(1); }
    //! Restore trace messages when reconfiguring pins
    static void RestoreConfigTrace() { _Trace(-1); }

private:
    struct AltSpec
    {
        constexpr AltSpec(unsigned pin, GPIOPin::Mode mode, uint8_t route, uint8_t loc)
            : spec(pin | mode << 8 | route << 16 | loc << 24) {}

        union
        {
            uint32_t spec;
            struct
            {
                uint8_t pin;
                GPIOPin::Mode mode;
                uint8_t route, loc;
            };
        };
    };

    void Configure(uint32_t mask, enum GPIOPin::Mode mode);
#ifdef EFM32_GPIO_LINEAR_INDEX
    void ConfigureAlternate(AltSpec spec, volatile uint32_t& routepen, unsigned locOffset);
#endif
#if defined(_SILICON_LABS_32B_SERIES_1)
    void ConfigureAlternate(AltSpec spec, volatile uint32_t& routepen, GPIOLocations_t locations);
#elif defined(_SILICON_LABS_32B_SERIES_2)
    void ConfigureAlternate(AltSpec spec, volatile uint32_t& routeen);
#endif
#ifdef Ckernel
    async(WaitFor, uint32_t indexAndState, Timeout timeout = Timeout::Infinite);
#endif

#if TRACE
    static bool _Trace(int n = 0) { static int noTrace = 0; return !(noTrace += n); }
#else
    static constexpr bool _Trace(int n = 0) { return false; }
#endif

    friend class GPIOPin;
    friend class GPIOBlock;
};

//! Represents the entire GPIO peripheral
class GPIOBlock : public GPIO_TypeDef
{
public:
    void EnableClock() { CMU->EnableGPIO(); }

private:
    uint32_t EnableInterrupt(GPIOPinID id, unsigned risingFalling);
    void DisableInterrupt(uint32_t mask);

    void ConfigureWakeFromEM4(GPIOPinID id, bool level);

    ALWAYS_INLINE void EnableTrace()
    {
#ifdef _SILICON_LABS_32B_SERIES_1
    // enable default SWO pin (PF2)
    MODMASK(P[5].MODEL, _GPIO_P_MODEL_MODE2_MASK, GPIO_P_MODEL_MODE2_PUSHPULL);
    ROUTEPEN |= GPIO_ROUTEPEN_SWVPEN;
#if EFM32_GPIO_DRIVE_CONTROL
    P[5].CTRL = EFM32_GPIO_DRIVE_DEFAULT;
#endif

    // enable AUXHFRCO
    CMU->EnableAUXHFRCO();
    while (!CMU->AUXHFRCOReady());
#elif defined(_SILICON_LABS_32B_SERIES_2)
    // enable watchdog
    CMU->EnableWDOG(0);
    // enable default SWO pin (PA3)
    TRACEROUTEPEN_SET = GPIO_TRACEROUTEPEN_SWVPEN;
#if EFM32_GPIO_DRIVE_CONTROL
    P[0].CTRL = EFM32_GPIO_DRIVE_DEFAULT;
#endif
    MODMASK(P[0].MODEL, _GPIO_P_MODEL_MODE3_MASK, GPIO_P_MODEL_MODE3_PUSHPULL);
#endif
    }

    friend class GPIOPin;
    friend class GPIOPort;
    friend void _efm32_startup();
};

DEFINE_FLAG_ENUM(enum GPIOPin::Mode);

class GPIOPin;

//! Represents an invalid/unused GPIO pin - it still gets a valid port, but no mask
#define Px       GPIOPin((GPIOPort*)&GPIO->P[0], 0)

ALWAYS_INLINE constexpr GPIOPinID GPIOPin::GetID() const { return GPIOPinID(GPIOPort::GetIndex(port), Index()); }

ALWAYS_INLINE void GPIOPin::Configure(Mode mode) const { port->Configure(mask, mode); }
#if defined(_SILICON_LABS_32B_SERIES_1)
ALWAYS_INLINE void GPIOPin::ConfigureAlternate(Mode mode, volatile uint32_t& routepen, uint8_t route, uint8_t locIndex, GPIOLocations_t locations) const { port->ConfigureAlternate(GPIOPort::AltSpec(Index(), mode, route, locIndex), routepen, locations); }
#elif defined(_SILICON_LABS_32B_SERIES_2)
ALWAYS_INLINE void GPIOPin::ConfigureAlternate(Mode mode, volatile uint32_t& routeen, unsigned penBit, unsigned routeOffset) const { port->ConfigureAlternate(GPIOPort::AltSpec(Index(), mode, penBit, routeOffset), routeen); }
#endif
#ifdef EFM32_GPIO_LINEAR_INDEX
ALWAYS_INLINE constexpr unsigned GPIOPin::GetLinearIndex(unsigned offset) const { return (Index() - offset + EFM32_GPIO_LINEAR_INDEX[GPIOPort::GetIndex(port)]) & 31; }
ALWAYS_INLINE void GPIOPin::ConfigureAlternate(Mode mode, volatile uint32_t& routepen, uint8_t route, uint8_t locIndex, unsigned locOffset) const { port->ConfigureAlternate(GPIOPort::AltSpec(Index(), mode, route, locIndex), routepen, locOffset); }
#endif
ALWAYS_INLINE uint32_t GPIOPin::EnableInterrupt(bool rising, bool falling) const { return GPIO->EnableInterrupt(GetID(), (rising * 1) | (falling * 2)); }
#ifdef Ckernel
ALWAYS_INLINE async(GPIOPin::WaitFor, bool state, Timeout timeout) { return async_forward(Port().WaitFor, (state << 4) | Index(), timeout); }
#endif
ALWAYS_INLINE void GPIOPin::ConfigureWakeFromEM4(bool level) const
{
    // configure input with filtering and pull away from the desired wakeup level
    Configure(Mode(InputPull | FlagFilter | (!level * FlagSet)));
    GPIO->ConfigureWakeFromEM4(GetID(), level);
}

ALWAYS_INLINE void GPIOPin::Set() const { EFM32_BITSET(port->DOUT, mask); }
ALWAYS_INLINE void GPIOPin::Res() const { EFM32_BITCLR(port->DOUT, mask); }
#ifdef EFM32_PERIPHERAL_BITTGL
ALWAYS_INLINE void GPIOPin::Toggle() const { EFM32_BITTGL(port->DOUT, mask); }
#else
ALWAYS_INLINE void GPIOPin::Toggle() const { port->DOUTTGL = mask; }
#endif
ALWAYS_INLINE void GPIOPin::Set(bool state) const { EFM32_BITMOD(state, port->DOUT, mask); }
ALWAYS_INLINE bool GPIOPin::Get() const { return port->DIN & mask; }

class APORTX : public APORT
{
public:
    constexpr APORTX(Fixed f) : APORT(f) {}
    constexpr APORTX(APORT other) : APORT(other) {}
#if EFM32_GPIO_APORT_AVAILABLE
    constexpr APORTX(const GPIOPin& pin) : APORT(pin.GetID().APORTX()){}
    ALWAYS_INLINE constexpr APORTX(const GPIOPinID pin) : APORT(pin.APORTX()) {}
#endif
};

class APORTY : public APORT
{
public:
    constexpr APORTY(Fixed f) : APORT(f) {}
    constexpr APORTY(APORT other) : APORT(other) {}
#if EFM32_GPIO_APORT_AVAILABLE
    constexpr APORTY(const GPIOPin& pin) : APORT(pin.GetID().APORTY()) {}
    ALWAYS_INLINE constexpr APORTY(const GPIOPinID pin) : APORT(pin.APORTY()) {}
#endif
};
